import React from 'react';

import style from '../../assets/style/scss/dostavka/dostavka.module.css'
import WayBlock from "../way-block/way-block";

const Dostavka = () => {
    return (
        <div className={style.main}>
            <WayBlock data={[
                {name: "Головна", url: "/home"},
                {name: "Доставка та оплата", url: "/delivery"}
            ]}/>
            <div className={style.main__gen}>
                <h4>Доставка та оплата товару</h4>
                <br/>
                <ul>
                    <li>Працюємо за передоплатою та післяплатою.</li>
                    <li>Сума замовлення - не менше 40 грн.</li>
                    <li>Після оформлення замовлення, протягом хвилини на ваш E-mail прийде лист з накладною, в якій зазначено товари, сума та реквізити для оплати замовлення.</li>
                    <li>Товар буде відправлений в офіс кур’єрської служби не пізніше, ніж через 2 дні, не враховуючи вихідних та святкових днів.</li>
                    <li>Після цього вам на E-mail буде відправлено № декларації для відстеження вантажу.</li>
                </ul>
                <b>Доставка та оплата товару по Україні здійснюється такими кур'єрськими службами:</b>
            </div>
            <div className={style.main__image}>
                <div className={style.main__image__item}><img src={'http://blackchip.com.ua/image/catalog/nova-poshta-ta-ukrposhta.jpg'}/></div>
                <div className={style.main__image__item}><b>Отримати товар в м. Львів можна після оформлення замовлення на сайті.</b></div>
            </div>
            <div className={style.main__bottom_inf}>
                <b>Варіанти оплати замовлення:</b>
                <ul>
                    <li>У будь-якому відділенні банку.</li>
                    <li>Через сайт або додаток Приват 24.</li>
                    <li>Банківський Термінал самообслуговування (Платіжний Термінал).</li>
                    <li>У відділенні Нової Пошти. Оплата при отриманні товару можлива тільки при виборі вами способу доставки «Нова Пошта». Ви оплачуєте вартість товару і доставки при отриманні посилки у вашому поштовому відділенні. Тариф на накладений платіж в Новій Пошті: + 2% від вартості замовлення і ще + 21 грн.</li>
                </ul>
            </div>
            
        </div>
    );
};

export default Dostavka;