import React from 'react';

import style from '../../assets/style/scss/vidgyky/vidgyky.module.css'
import WayBlock from "../way-block/way-block";
import VidgykyItem from "./vidgyku-item/vidgyky-item";

const Vidgyky = () => {

    const arr = [
        {
            name: "Михаил Слинько",
            data: "01.05.2021",
            resp: "Все якісно і швидко. Рекомендую."
        },
        {
            name: "Олександр",
            data: "09.03.2021",
            resp: "Інтернет-магазин працює напрочуд організовано та оперативно. Запропоновані магазином ціни доступні та по багатьом позиціям нижчі, ніж в інших інтернет-магазинах України.\n" +
                "РЕКОМЕНДУЮ !!!"
        },
        {
            name: "Громко Виктор",
            data: "09.03.2021",
            resp: "Хороший магазин, ввічливий, професійний менеджер. Асортимент широкий, ціни нормальні, Все оперативно відправили. Купував за передоплатою, заслуговують на довіру. Покупкою дуже задоволений. Дякую. Однозначно рекомендую магазин для покупок."
        },
        {
            name: "Олександр",
            data: "21.01.2021",
            resp: "Приємно здивований роботою магазину. За півтори години після оформлення замовлення необхідні мені деталі вже були в мене. Адміністрація швидко відповідає на повідомлення. Рекомендую!\n"
        },
        {
            name: "Михайло",
            data: "26.11.2018",
            resp: "Замовляв тут вперше, відправили через Укрпошту без питань, отримав, все чудово працює. Магазин працює оперативно. Магазином задоволений як і товаром, надалі буду замовляти в даному магазині оскільки є потрібний мені асортимент і низькі ціни.\n"
        }
    ]

    let item = arr.map(i => <VidgykyItem date={i} key={i.resp}/>)

    return (
        <div className={style.main}>
            <WayBlock data={[
                {name: "Головна", url: "/home"},
                {name: "Відгуки", url: "/responds"}
            ]}/>
            <div>
                {item}
            </div>
            
        </div>
    );
};

export default Vidgyky;